# 🔥 mapping สำหรับ decode class → ตัวอักษร / จังหวัด
# def get_thai_character(code):
#     mapping = {
#         # ตัวอักษร
#         "A01": "ก", "A02": "ข", "A04": "ค", "A06": "ฆ", "A07": "ง", "A08": "จ",
#         "A09": "ฉ", "A10": "ช", "A12": "ฌ", "A13": "ญ", "A14": "ฎ", "A16": "ฐ",
#         "A18": "ฒ", "A19": "ณ", "A20": "ด", "A21": "ต", "A22": "ถ", "A23": "ท",
#         "A24": "ธ", "A25": "น", "A26": "บ", "A27": "ป", "A28": "ผ", "A30": "พ",
#         "A31": "ฟ", "A32": "ภ", "A33": "ม", "A34": "ย", "A35": "ร", "A36": "ล",
#         "A37": "ว", "A38": "ศ", "A39": "ษ", "A40": "ส", "A41": "ห", "A42": "ฬ",
#         "A43": "อ", "A44": "ฮ",

#     "ACR": "อำนาจเจริญ",
#     "ATG": "อ่างทอง",
#     "AYA": "พระนครศรีอยุธยา",
#     "BKK": "กรุงเทพมหานคร",
#     "BKN": "บึงกาฬ",
#     "BRM": "บุรีรัมย์",
#     "BTG": "บางที",
#     "CBI": "ชลบุรี",
#     "CCO": "ฉะเชิงเทรา",
#     "CMI": "เชียงใหม่",
#     "CNT": "เชียงราย",
#     "CPM": "ชัยภูมิ",
#     "CPN": "ชุมพร",
#     "CRI": "เชียงราย",
#     "CTI": "จันทบุรี",
#     "KBI": "กระบี่",
#     "KKN": "ขอนแก่น",
#     "KPT": "กำแพงเพชร",
#     "KRI": "กาญจนบุรี",
#     "KSN": "กาฬสินธุ์",
#     "LEI": "เลย",
#     "LPG": "ลำปาง",
#     "LPN": "ลำพูน",
#     "LRI": "ลพบุรี",
#     "MDH": "มหาสารคาม",
#     "MKM": "แม่ฮ่องสอน",
#     "MSN": "แม่สอด",
#     "NAN": "น่าน",
#     "NBI": "นนทบุรี",
#     "NBP": "นครปฐม",
#     "NKI": "นครศรีธรรมราช",
#     "NMA": "นครสวรรค์",
#     "NPM": "นครพนม",
#     "NPT": "นครปฐม",
#     "NSN": "หนองคาย",
#     "NST": "นครศรีธรรมราช",
#     "NYK": "หนองคาย",
#     "PBI": "เพชรบุรี",
#     "PCT": "เพชรบูรณ์",
#     "PKN": "ประจวบคีรีขันธ์",
#     "PKT": "ภูเก็ต",
#     "PLG": "พัทลุง",
#     "PLK": "พิษณุโลก",
#     "PNA": "พังงา",
#     "PNB": "ปัตตานี",
#     "PRE": "แพร่",
#     "PRI": "ปราจีนบุรี",
#     "PTE": "ปทุมธานี",
#     "PTN": "ปัตตานี",
#     "PYO": "พะเยา",
#     "RBR": "ราชบุรี",
#     "RET": "ร้อยเอ็ด",
#     "RNG": "ระนอง",
#     "RYG": "ระยอง",
#     "SBR": "สิงห์บุรี",
#     "SKA": "สงขลา",
#     "SKM": "สมุทรสงคราม",
#     "SKN": "สมุทรสาคร",
#     "SKW": "สมุทรปราการ",
#     "SNI": "สระแก้ว",
#     "SNK": "สระบุรี",
#     "SPB": "สุพรรณบุรี",
#     "SPK": "สมุทรปราการ",
#     "SRI": "ศรีสะเกษ",
#     "SRN": "สุรินทร์",
#     "SSK": "ศรีสะเกษ",
#     "STI": "สตูล",
#     "TAK": "ตาก",
#     "TRG": "ตรัง",
#     "TRT": "ตราด",
#     "UBN": "อุบลราชธานี",
#     "UDN": "อุดรธานี",
#     "UTI": "อุตรดิตถ์",
#     "UTT": "อุทัยธานี",
#     "YLA": "ยะลา",
#     "YST": "ยโสธร"
#     }

#     return mapping.get(code, code)


def get_thai_character(code):
    mapping = {
    # ตัวอักษร
    "A01": "ก","A02": "ข","A03": "ฃ","A04": "ค","A05": "ฅ","A06": "ฆ","A07": "ง",
    "A08": "จ","A09": "ฉ","A10": "ช","A11": "ซ","A12": "ฌ","A13": "ญ",
    "A14": "ฎ","A15": "ฏ","A16": "ฐ","A17": "ฑ","A18": "ฒ","A19": "ณ",
    "A20": "ด","A21": "ต","A22": "ถ","A23": "ท","A24": "ธ","A25": "น",
    "A26": "บ","A27": "ป","A28": "ผ","A29": "ฝ","A30": "พ","A31": "ฟ",
    "A32": "ภ","A33": "ม","A34": "ย","A35": "ร","A36": "ล","A37": "ว",
    "A38": "ศ","A39": "ษ","A40": "ส","A41": "ห","A42": "ฬ","A43": "อ","A44": "ฮ",

    #จังหวัด
    "BKK": "กรุงเทพมหานคร",
    "KKN": "ขอนแก่น",
    "CMI": "เชียงใหม่",
    "CRI": "เชียงราย",
    "CPM": "ชัยภูมิ",
    "CPN": "ชุมพร",
    "CTI": "จันทบุรี",
    "CBI": "ชลบุรี",
    "CCO": "ฉะเชิงเทรา",
    "KBI": "กระบี่",
    "KRI": "กาญจนบุรี",
    "KSN": "กาฬสินธุ์",
    "NKI": "นครศรีธรรมราช",
    "NMA": "นครสวรรค์",
    "NPM": "นครพนม",
    "NBP": "นครปฐม",
    "NBI": "นนทบุรี",
    "NAN": "น่าน",
    "NSN": "หนองคาย",
    "NBL": "หนองบัวลำภู",
    "NYK": "นครนายก",
    "PBI": "เพชรบุรี",
    "PCT": "เพชรบูรณ์",
    "PKN": "ประจวบคีรีขันธ์",
    "PKT": "ภูเก็ต",
    "PLG": "พัทลุง",
    "PLK": "พิษณุโลก",
    "PNA": "พังงา",
    "PNB": "ปัตตานี",
    "PRE": "แพร่",
    "PRI": "ปราจีนบุรี",
    "PTE": "ปทุมธานี",
    "PYO": "พะเยา",
    "PJR": "พิจิตร",
    "AYA": "พระนครศรีอยุธยา",
    "ATG": "อ่างทอง",
    "ACR": "อำนาจเจริญ",
    "RBR": "ราชบุรี",
    "RET": "ร้อยเอ็ด",
    "RNG": "ระนอง",
    "RYG": "ระยอง",
    "SBR": "สิงห์บุรี",
    "SKA": "สงขลา",
    "SKM": "สมุทรสงคราม",
    "SMK": "สมุทรสาคร",
    "SKW": "สมุทรปราการ",
    "SNI": "สระแก้ว",
    "SRB": "สระบุรี",
    "SPB": "สุพรรณบุรี",
    "SRI": "ศรีสะเกษ",
    "SRN": "สุรินทร์",
    "STI": "สตูล",
    "STK": "สุโขทัย",
    "SRT": "สุราษฎร์ธานี",
    "TAK": "ตาก",
    "TRG": "ตรัง",
    "TRT": "ตราด",
    "UBN": "อุบลราชธานี",
    "UDN": "อุดรธานี",
    "UTI": "อุตรดิตถ์",
    "UTT": "อุทัยธานี",
    "YLA": "ยะลา",
    "YST": "ยโสธร",
    "BKN": "บึงกาฬ",
    "BRM": "บุรีรัมย์",
    "LPG": "ลำปาง",
    "LPN": "ลำพูน",
    "LRI": "ลพบุรี",
    "LEI": "เลย",
    "MDH": "มหาสารคาม",
    "MKM": "แม่ฮ่องสอน",
    "NRM": "นครราชสีมา",
    "PHR": "พิจิตร",
    "NRW": "นราธิวาส",
    "SKN": "สกลนคร",   
    "CNT": "ชัยนาท",
    "KPT": "กำแพงเพชร",
    "MWI": "มุกดาหาร"

    }

    return mapping.get(code, code)



# 🔥 list จังหวัด (ใช้ match เท่านั้น)
data_province = [
    "กระบี่", "กรุงเทพมหานคร", "กาญจนบุรี", "กาฬสินธุ์",
    "กำแพงเพชร", "ขอนแก่น", "จันทบุรี", "ฉะเชิงเทรา", "ชลบุรี",
    "ชัยนาท", "ชัยภูมิ", "ชุมพร", "เชียงราย", "เชียงใหม่",
    "ตรัง", "ตราด", "ตาก", "นครนายก", "นครปฐม",
    "นครพนม", "นครราชสีมา", "นครศรีธรรมราช", "นครสวรรค์", "นนทบุรี",
    "นราธิวาส", "น่าน", "บึงกาฬ", "บุรีรัมย์", "ปทุมธานี",
    "ประจวบคีรีขันธ์", "ปราจีนบุรี", "ปัตตานี", "พระนครศรีอยุธยา", "พะเยา",
    "พังงา", "พัทลุง", "พิจิตร", "พิษณุโลก", "เพชรบุรี",
    "เพชรบูรณ์", "แพร่", "ภูเก็ต", "มหาสารคาม", "มุกดาหาร",
    "แม่ฮ่องสอน", "ยโสธร", "ยะลา", "ร้อยเอ็ด", "ระนอง",
    "ระยอง", "ราชบุรี", "ลพบุรี", "ลำปาง", "ลำพูน",
    "เลย", "ศรีสะเกษ", "สกลนคร", "สงขลา", "สตูล",
    "สมุทรปราการ", "สมุทรสงคราม", "สมุทรสาคร", "สระแก้ว", "สระบุรี",
    "สิงห์บุรี", "สุโขทัย", "สุพรรณบุรี", "สุราษฎร์ธานี", "สุรินทร์",
    "หนองคาย", "หนองบัวลำภู", "อ่างทอง", "อำนาจเจริญ", "อุดรธานี",
    "อุตรดิตถ์", "อุทัยธานี", "อุบลราชธานี",
]


# 🔥 ฟังก์ชันแยกทะเบียน + จังหวัด (robust)
def split_license_plate_and_province(text):
    province = None

    # 🔥 match ยาวก่อน (สำคัญมาก)
    provinces_sorted = sorted(data_province, key=len, reverse=True)

    for p in provinces_sorted:
        if p in text:
            province = p
            text = text.replace(p, "")
            break

    license_plate = text.strip()

    # 🔥 fallback กัน None
    # if province is None:
    #     province = "ไม่ทราบ"

    return license_plate, province